app/Controllers/LoginController.php

SELECT *
FROM `pegawai`
WHERE `email` = 'latif@klinikapp.com'
 LIMIT 1
---
  public function login()
  {
  $email = $this->request->getVar('email');
  $password = $this->request->getVar('password');

  $model = new MPegawai();
  $pegawai = $model->where(['email' => $email])->first();