app/Controllers/PasienController.php

INSERT INTO `pasien` (`nomor_rm`, `nama`, `tanggal_lahir`, `nomor_telepon`, `alamat`) VALUES ('122', '11', '111', '111', '11')
SELECT *
FROM `pasien`
WHERE `pasien`.`id` = 6
---
    public function tambah()
     {
        $data = ['nomor_rm' => $this->request->getVar('nomor_rm')];
        $data += ['nama' => $this->request->getVar('nama')];
        $data += ['tanggal_lahir' => $this->request->getVar('tanggal_lahir')];
        $data += ['nomor_telepon' => $this->request->getVar('nomor_telepon')];
        $data += ['alamat' => $this->request->getVar('alamat')];

     $model = new MPasien();
     $model->insert($data);
     $pasien = $model->find($model->getInsertID());

SELECT *
FROM `pasien`
---
     public function list()
     {
     $model = new MPasien();
     //$pasien = $this->db->query("Select * from pasien");
     $pasien = $model->findAll(); //select * from pasien

SELECT *
FROM `pasien`
WHERE `pasien`.`id` = 'null'
---
     public function detail($id)
     {
     $model = new MPasien();
     $pasien = $model->find($id); //select * from pasien where id='$id'

DELETE FROM `pasien`
WHERE `id` IN ('6')
---
     public function hapus($id)
     {
     $model = new MPasien();
     $pasien = $model->delete($id);