app/Controllers/PegawaiController.php

SELECT *
FROM `pegawai`
---
     public function list()
     {
     $model = new MPegawai();
     $pegawai = $model->findAll();

SELECT *
FROM `pegawai`
WHERE `pegawai`.`id` = 'null'
---
     public function detail($id)
     {
     $model = new MPegawai();
     $pegawai = $model->find($id);