app/Controllers/PoliController.php

SELECT *
FROM `poli`
---
     public function list()
     {
     $model = new MPoli();
     $poli = $model->findAll();

SELECT *
FROM `poli`
WHERE `poli`.`id` = '4'
---
     public function detail($id)
     {
     $model = new MPoli();
     $poli = $model->find($id);